{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-PAIN_NRS",
    "2": "I-PAIN_NRS",
    "3": "B-PAIN_LOCATION",
    "4": "I-PAIN_LOCATION",
    "5": "B-DYSPNEA",
    "6": "I-DYSPNEA",
    "7": "B-WOB",
    "8": "I-WOB",
    "9": "B-NAUSEA",
    "10": "I-NAUSEA",
    "11": "B-DIARRHEA",
    "12": "I-DIARRHEA",
    "13": "B-O2_DEVICE",
    "14": "I-O2_DEVICE",
    "15": "B-O2_FLOW",
    "16": "I-O2_FLOW",
    "17": "B-SPO2",
    "18": "I-SPO2",
    "19": "B-TEMP",
    "20": "I-TEMP",
    "21": "B-HR",
    "22": "I-HR",
    "23": "B-RR",
    "24": "I-RR",
    "25": "B-BP_SYS",
    "26": "I-BP_SYS",
    "27": "B-BP_DIA",
    "28": "I-BP_DIA",
    "29": "B-ISOLATION_REQUIRED",
    "30": "I-ISOLATION_REQUIRED",
    "31": "B-MDRO_FLAG",
    "32": "I-MDRO_FLAG",
    "33": "B-CULTURE_ORDERED",
    "34": "I-CULTURE_ORDERED",
    "35": "B-ABX_EVENT",
    "36": "I-ABX_EVENT"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ABX_EVENT": 35,
    "B-BP_DIA": 27,
    "B-BP_SYS": 25,
    "B-CULTURE_ORDERED": 33,
    "B-DIARRHEA": 11,
    "B-DYSPNEA": 5,
    "B-HR": 21,
    "B-ISOLATION_REQUIRED": 29,
    "B-MDRO_FLAG": 31,
    "B-NAUSEA": 9,
    "B-O2_DEVICE": 13,
    "B-O2_FLOW": 15,
    "B-PAIN_LOCATION": 3,
    "B-PAIN_NRS": 1,
    "B-RR": 23,
    "B-SPO2": 17,
    "B-TEMP": 19,
    "B-WOB": 7,
    "I-ABX_EVENT": 36,
    "I-BP_DIA": 28,
    "I-BP_SYS": 26,
    "I-CULTURE_ORDERED": 34,
    "I-DIARRHEA": 12,
    "I-DYSPNEA": 6,
    "I-HR": 22,
    "I-ISOLATION_REQUIRED": 30,
    "I-MDRO_FLAG": 32,
    "I-NAUSEA": 10,
    "I-O2_DEVICE": 14,
    "I-O2_FLOW": 16,
    "I-PAIN_LOCATION": 4,
    "I-PAIN_NRS": 2,
    "I-RR": 24,
    "I-SPO2": 18,
    "I-TEMP": 20,
    "I-WOB": 8,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.6",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 16424
}
